export function LoadTrainingRecords(fileName="../record.txt") {
  // content=fetch(fileName).then(response => response.text());
//   getRawContent().then(content => {
//     console.log(content);
//     return content;
//   }, reason => {
//     console.log(reason);
//     return reason;
//   });
    return `8.29
深蹲40kg 5 5 5
卧推40kg 5 5 5
下拉45kg 5 5 5

9.2
深蹲45kg 5 5 5
下拉55kg 5 5 5
卧推50kg 5 5 5

9.5
卧推55kg 5 5 5
下拉60kg 5 5 5
推举22.5kg 5 5 5

9.7// 没睡好
深蹲50kg 5 5 5
卧推60kg 5 5 4//最后一组歪得比较厉害
下拉65kg 5 5 4

9.9 //没睡好
深蹲55kg 5 5 5
卧推60kg 5 6 5
推举25kg 5 5 5

9.10
硬拉45kg 5 5 5
下拉65kg 5 5 5

9.12 //没睡好
深蹲60kg 5 5 5//屁股眨眼很厉害，但是可控制
卧推65kg 5 5 3
推举27.5kg 5 5 4

9.16 //心慌
深蹲65kg 5 5 5 //左右基本平衡 屁股眨眼有改善
卧推65kg 5 5 4 //被视奸
推举27.5kg 5 5 5

9.19
深蹲70kg 5 5 5 //下次只能加2.5kg 了
卧推65kg 5 5 4 //下次退2.5kg
下拉70kg 5 5 5

9.21
深蹲72.5kg 5 5 5 //有点紧张 但还是完成了！
卧推62.5kg 5 5 5 //质量很高，最后一组开始借力了
推举30kg 5 5 5

9.25
深蹲75kg 5 5 5 //又开始眨眼了？？？？
卧推65kg 5 5 5//最后一个有点变形 陈镕泽的斜握真的很有效！
下拉75kg 5 5 4

9.27
深蹲77.5kg 5 5 5//腹部收紧就可以避免眨眼 下次稳住 好像有点歪 而且腰部压力有 肩膀拉伤了？无语
卧推67.5kg 5 5 3.5 //开始歪了？？？
下拉75kg 5 5 4//退行

9.30
深蹲80kg 5 5 5 //调整后还可以 下次稳住 眼镜又掉了妈的！！！！
卧推70kg 5 5 4//憋住气就会好很多！！！最后一个歪了，下次加油

10.3
深蹲82.5kg 5 5 5 //太热了 到85要稳两次，其实动作看不出什么问题主要是太热了
卧推70kg 5 5 4//肩膀一直有暗伤 下次就应该可以做满了！

10.5
深蹲85kg 5 5 5下次要稳 注意不对称
卧推70kg 5 5 5 肩伤导致的表现差，应考虑停训🤦🏻‍♂️

10.7
深蹲87.5kg 5 5 5 腰不太行了啊，应该开始戴腰带了～

10.9
深蹲40kg 12 12 12 12 10
并脚蹲0kg 12 10 10 10
单车12min

10.11
卧推40kg 12 12 12 9中缝很撕裂 可以
上斜卧推20kg 9 8 10 11
平板飞鸟8kg 12 12 12 11 重温一下陈荣泽

10.13
划船30kg 12 12 12 10
下拉40kg 12 10 10 被垃圾肥逼打扰了 肩膀也开始疼
划船机20kg 12 11 11 10 E

10.17
卧推42.5kg 12 12 12 10 8
上斜卧推20kg 11 9 9 9先不要下太低 注意手臂在一个平面内
平板飞鸟10kg 12 12 12 11 收紧核心 手肘打开

10.18
深蹲42.5kg 12 12 12 11 10左右不平衡
并脚蹲2.5kg 12 12 12 10

10.21
划船30kg 12 12 12 11 10//还需要再体会动作 应该也是左右不平衡 恢复肌腱
下拉25kg 12 12 12 9//再探索一下动作怎么做
划船机22.5kg 12 12 12 12//可
//睡前要加餐 周期应该逐渐缩短 补剂每天吃 买鱼油

10.24
深蹲45kg 12 12 12 12 10 9
并脚蹲5kg 12 11 12 12 垫脚 收膝盖 居然没有那么想死了

10.26
卧推45kg 12 12 10 10 5
上斜20kg 10 11 10 10？怎么还是肩膀疼？
平板哑铃12.5kg 12 9 10kg 10 10

10.28
杠铃划船32.5kg 12 12 12 9 8
下拉30kg 12 12 12 10 肩膀还是在痛
划船18kg 10 11 11 11

10.29
深蹲47.5kg 12 12 11 10 42.5kg 10 9 深蹲太吃状态了，一定要休息好再开始，哪怕推迟到第二天
并脚蹲5kg 12 12 12 10

10.30
卧推40kg 12 12 9 8//需要适应乐刻的器材 应该压到胸肌中间 这次压到是锁骨所以会肩膀痛 不对称很严重
上斜15kg 12 12 12 9
平板哑铃12.5kg 12 12 11 10kg 10

11.1
杠铃划船32.5kg 12 12 12 12 9//还是歪 发力感并不好
下拉30kg 12 12 12 12
划船18kg 12 12 12 11
杠铃弯举12.5kg 10 10 12 12
哑铃弯举5kg 13 13 13 12

11.3
卧推47.5kg 12 12 9 8
上斜20kg 12 11 10 9 也许下次应该用个重一点的
平板哑铃12.5kg 12 12 11 9收紧核心 发力感很好
碎裂者10kg 12

11.5
深蹲47.5kg 12 12 12 11 8 8 深蹲真的不可以在乐刻做
窄蹲7.5kg 12 12 12 12

11.8
杠铃划船35kg 12 12 12 10
下拉31.25 12 12 12 11
划船20kg 12 12 12 12
杠铃弯举12.5kg 12 12 12 10
哑铃弯举6kg 10 11 10 9

11.10状态实属不行 太抑郁了
卧推47.5kg 12 12 9 7
上斜25kg 8 8 9 9
哑铃飞鸟12.5kg 11 10 8
碎裂者12.5kg 10 10

11.12
深蹲50kg 12 12 11 10 8 8
窄蹲7.5kg 12 12 12 11

11.14
杠铃划船35kg 12 12 12 12
下拉33.75kg 12 12 10 10
划船22.5kg 12 12 11 11
哑铃弯举6kg 14 13 12 11 9
杠铃弯举12.5kg 10 10 9 8

11.17//困死了 状态很差但有进步
卧推47.5kg 12 12 12 8 9//有人来视奸，本来可以做9个，下次如果状态好可以加
上斜25kg 12 10 11 9//要慢一点
哑铃飞鸟12.5kg 11 10 9 8
碎裂者12.5kg 14 12 11 10
屈伸7.5kg 12 12 12 12

11.19
深蹲52.5kg 12 12 10 9 7//应该注意顶峰收缩，不要在膝盖伸直的时候偷懒！！！！
窄蹲10kg 12 10 10 9

11.20
杠铃划船20kg 11 10 10 10
下拉30kg 12 11 11 10
绳索划船16kg 11 9 9
哑铃弯举7.5kg 13 12 11 9 8
杠铃弯举12.5kg 13 12 11 10

11.22
卧推50kg 12 12 10 8
上斜25kg 10 10 9 8//核心应该收紧 还需要找感觉
哑铃飞鸟12.5kg 12 10 9 10kg 10
碎裂者12.5kg 15 15 15kg 12 11 9
屈伸10kg 15 12 12 12

11.26
深蹲52.5kg 12 12 10 10 8 6//前一天登山影响状态 下次先不要加
窄蹲10kg 12 11 9 9//注意顶峰收缩

11.27
卧推50kg 12 12 8 8 //不太舒服？
上斜20kg 9 11 10 10 //注意看两侧小臂是否竖直 肩胛骨不要动 用固定器械会更好一点，方便固定水平位置
哑铃飞鸟12.5kg 12 12 8 8
碎裂者15kg 12 12 10 9
屈伸13.6kg 11 10 10 9
哑铃弯举7.5kg 15 14 12 10kg 6
杠铃弯举12.5kg 12 12 10 9

11.29
杠铃划船30kg 12 11 9 8
下拉20kg 11 10 10 10
哑铃弯举8kg 14 12 10 10
杠铃弯举12.5kg 12 10 10 10 //带测力计量杠铃重量

11.30
卧推50kg 12 12 7 7//没休息好🥲下次状态好可加
哑铃飞鸟12.5kg 8
碎裂者15kg 14 12 11 10
屈伸12.5kg 14 12 11 11

12.2
深蹲55kg 12 12 8 7//前一天晚上休息太差了，看起来有潜力做更多

12.3
杠铃划船25kg 12 12 10 9
下拉23kg 12 12 11 11
弯举10kg 13 12 10 8
杠铃弯举12.5kg 15 12 12 12
肩后18kg 12 12 12 12

12.4
卧推52.5kg 12 11 8 7
哑铃飞鸟12.5kg 12 11 10 9
碎裂者17.5kg 13 12 11 9
屈伸13.6kg 12 11 10 9

12.6
杠铃划船27.5kg 13 12 10 10
下拉26.25kg 12 12 11 10
哑铃弯举10kg 15 13 10 8
杠铃弯举15kg 11 10 9 9

12.8
卧推55kg 12 11 7 7
哑铃飞鸟12.5kg 12 11 10 9
碎裂者17.5kg 14 13 10 9
屈伸15kg 12 11 10 10

12.10
杠铃划船30kg 12 12 10 9
下拉29kg 10 10 9 9
哑铃弯举10kg 15 12 9状态太差 休息

12.11
史密斯卧推55kg 12 9 7 6
哑铃飞鸟12.5kg 11 10 9 8
碎裂者17.5kg 15 14 12 10
屈伸16kg 12 10 9 8
哑铃弯举10kg 15 14 11 8
杠铃弯举15kg 12 11 10 9

12.15
卧推55kg 12 12 7 52.5kg 8(退行？
哑铃飞鸟12.5kg 11 10 8 8
碎裂者20kg 12 10 8 8
屈伸15kg 13 12 13 11
弯举10kg 12 12.5kg 9 8 6

1.2
杠铃划船20kg 11 12 10 10
下拉18kg 9 10 11 10
哑铃弯举7.5kg 15 10kg 14 8 7.5kg 11
杠铃弯举10kg 10
FacePull2.5kg 12 15 13 13

1.3
推举10kg 12 12 12 11
卧推40kg 12 12 11 9
哑铃飞鸟8kg 10 10 10
碎裂者12.5kg 14 12 12 11
屈伸10kg 15 15 15 15

1.5
杠铃划船25kg 12 12 12 9有点太快了
下拉19kg 12 11 11 10
哑铃弯举10kg 13 12 9 7
杠铃弯举10kg 12 12 11 10
FacePull5kg 13 12 12 12

1.10
卧推45kg 12 12 10 8
飞鸟8kg 10 10 10
碎裂者15kg 14 12 12 10
屈伸12.5kg 13 12 13 11
推举12.5kg 12 11 8

1.12(重量有点激进
杠铃划船30kg 12 12 9 7
下拉21kg 11 11 11 10
哑铃弯举12.5kg 11 8 10kg (器械被占)
杠铃弯举12.5kg 12 12 10
FacePull5kg 15 7.5kg 14 13 13

1.15
杠铃划船25kg 12 10 20kg 10 10
下拉20kg 8 10 10 9
哑铃弯举10kg 13 12 10 8
杠铃弯举12.5kg 12 11 10 10
FacePull7.5kg 15 12 13 12

1.16
卧推47.5kg 12 12 9 8
飞鸟8kg 12 11 11 11
碎裂者15kg 15 14 12 10
屈伸12.5kg 15 14 13 12
推举12.5kg 11 11 9
FacePull7.5kg 13 12

1.28
卧推30kg 12 12 11 11
飞鸟8kg 10 10 10 9
碎裂者10kg 15 12 11
屈伸7.5kg 16 10kg 15 15 13
FacePull5kg 15 14 14 14 13

1.29
杠铃划船20kg 13 12 11 10
下拉16kg 12 12 12 12
哑铃弯举8kg 15 15 14 12
杠铃弯举10kg 12 12 12 12
推举12.5kg 12 11 9

2.1
卧推35kg 12 12 12 11 非常轻松
飞鸟8kg 11 11 11 10
碎裂者12.5kg 15 14 13 12
屈伸12.5kg 15 14 13 12
FacePull7.5kg 15 10kg 12 11 11 10 有点重哈

2.2
反手杠铃划船22.5kg 12 12 11 10
下拉18.75kg 12 12 12 12
哑铃弯举10kg 14 12 9 8
杠铃弯举12.5kg 12 11 12 10

2.3
深蹲60kg 5 5 5 5 5
侧平举2.5kg 15 15 15 15
FacePull10kg 15 13 12 11
推举10kg 10 8

2.6//脊柱侧弯会影响对称性 要时刻注意矫正
卧推40kg 12 12 11 11 状态差 有点勉强
飞鸟8kg 10 10 10 11
碎裂者15kg  14 13 12 9
屈伸15kg 13 12 11 10
FacePull10kg 15 15 14 13 进步很快
侧平举3kg 16 16 15 14

2.7
反手杠铃划船25kg 12 12 11 10做太快了
下拉21.25kg 12 12 12 12
哑铃弯举10kg 15 14 11 8
杠铃弯举15kg 10 11 10 9
推举10kg 12 12 12 11
侧平举4kg 15 15 15 14

2.10
卧推45kg 12 12 10 9
飞鸟8kg 10 10 10 10
碎裂者15kg 15 15 13 10
屈伸15kg 14 13 12 11
FacePull12.5kg 15 13 13 12
侧平举4kg 16 16 15 14

2.13
反手杠铃划船25kg 12 12 12 12
下拉23.75kg 12 12 12 11
哑铃弯举10kg 15 14 10 10 后面组歇要两分钟
杠铃弯举15kg 12 12 11 10
推举12.5kg 12 12 12 12
侧平举5/3kg 15/12 13/10 11/9 9/7

2.14
卧推47.5kg 12 12 11 9
飞鸟10kg 10 10 10 10
碎裂者17.5kg 15 14 11 10
屈伸15kg 15 14 12 11
FacePull15kg 15 14 11 11

2.15
深蹲40kg 9 9 7 6
窄蹲2.5kg 12 11 10 10

2.16
反手杠铃划船27.5kg 12 12 11 9
下拉26.25kg 12 12 11 10
哑铃弯举12.5kg 12 10 8 7
杠铃弯举15kg 13 12 11 10
推举15kg 13 12 12 10
侧平举5/3kg 15/12 14/10 11/8 12/9
`
}


export const movementDefinitions = [
    {
        part: "Shoulder", movements: [
            "FacePull",
            "侧平举",
            "推举"
        ]
    },
    {
        part: "Chest", movements: [
            "上斜卧推",
            "卧推",
            "飞鸟",
            "哑铃飞鸟",
            "平板哑铃",
            "平板飞鸟"
        ]
    },
    {
        part: "Back", movements: [
            "下拉",
            "划船",
            "反手杠铃划船",
            "杠铃划船",
            "绳索划船"
        ]
    },
    {
        part: "Bicep", movements: [
            "哑铃弯举",
            "杠铃弯举",
            "弯举"
        ]
    },
    {
        part: "Tricep", movements: [
            "屈伸",
            "碎裂者"
        ]
    },
    {
        part: "Legs", movements: [
            "并脚蹲",
            "深蹲",
            "窄蹲",
            "硬拉"
        ]
    }
]


export const movementToPart = new Map<string, string>();

movementDefinitions.map((definition) => {
    return definition.movements.map((movement) => [movement, definition.part])
}).reduce((a, b) => a.concat(b), []).forEach((pair) => {
    movementToPart.set(pair[0], pair[1]);
});