export function LoadTrainingRecords(fileName = "../record.txt") {
    // content=fetch(fileName).then(response => response.text());
    //   getRawContent().then(content => {
    //     return content;
    //   }, reason => {
    //     return reason;
    //   });
    return `8.29
深蹲 40kg 5 5 5
卧推 40kg 5 5 5
下拉 45kg 5 5 5

2022.9.2
深蹲 45kg 5 5 5
下拉 55kg 5 5 5
卧推 50kg 5 5 5

2022.9.5
卧推 55kg 5 5 5
下拉 60kg 5 5 5
推举 22.5kg 5 5 5

2022.9.7// 没睡好
深蹲 50kg 5 5 5
卧推 60kg 5 5 4//最后一组歪得比较厉害
下拉 65kg 5 5 4

2022.9.9 //没睡好
深蹲 55kg 5 5 5
卧推 60kg 5 6 5
推举 25kg 5 5 5

2022.9.10
硬拉 45kg 5 5 5
下拉 65kg 5 5 5

2022.9.12 //没睡好
深蹲 60kg 5 5 5//屁股眨眼很厉害，但是可控制
卧推 65kg 5 5 3
推举 27.5kg 5 5 4

2022.9.16 //心慌
深蹲 65kg 5 5 5 //左右基本平衡 屁股眨眼有改善
卧推 65kg 5 5 4 //被视奸
推举 27.5kg 5 5 5

2022.9.19
深蹲 70kg 5 5 5 //下次只能加2.5kg 了
卧推 65kg 5 5 4 //下次退2.5kg
下拉 70kg 5 5 5

2022.9.21
深蹲 72.5kg 5 5 5 //有点紧张 但还是完成了！
卧推 62.5kg 5 5 5 //质量很高，最后一组开始借力了
推举 30kg 5 5 5

2022.9.25
深蹲 75kg 5 5 5 //又开始眨眼了？？？？
卧推 65kg 5 5 5//最后一个有点变形 陈镕泽的斜握真的很有效！
下拉 75kg 5 5 4

2022.9.27
深蹲 77.5kg 5 5 5//腹部收紧就可以避免眨眼 下次稳住 好像有点歪 而且腰部压力有 肩膀拉伤了？无语
卧推 67.5kg 5 5 3.5 //开始歪了？？？
下拉 75kg 5 5 4//退行

2022.9.30
深蹲 80kg 5 5 5 //调整后还可以 下次稳住 眼镜又掉了妈的！！！！
卧推 70kg 5 5 4//憋住气就会好很多！！！最后一个歪了，下次加油

2022.10.3
深蹲 82.5kg 5 5 5 //太热了 到85要稳两次，其实动作看不出什么问题主要是太热了
卧推 70kg 5 5 4//肩膀一直有暗伤 下次就应该可以做满了！

2022.10.5
深蹲 85kg 5 5 5//下次要稳 注意不对称
卧推 70kg 5 5 5// 肩伤导致的表现差，应考虑停训🤦🏻‍♂️

2022.10.7
深蹲 87.5kg 5 5 5// 腰不太行了啊，应该开始戴腰带了～

2022.10.9
深蹲 40kg 12 12 12 12 10
并脚蹲 0kg 12 10 10 10
//单车12min

2022.10.11
卧推 40kg 12 12 12 9//中缝很撕裂 可以
上斜卧推 20kg 9 8 10 11
平板飞鸟 8kg 12 12 12 11 //重温一下陈荣泽

2022.10.13
划船 30kg 12 12 12 10
下拉 40kg 12 10 10 //被垃圾肥逼打扰了 肩膀也开始疼
划船机 20kg 12 11 11 10 E

2022.10.17
卧推 42.5kg 12 12 12 10 8
上斜卧推 20kg 11 9 9 9//先不要下太低 注意手臂在一个平面内
平板飞鸟 10kg 12 12 12 11 //收紧核心 手肘打开

2022.10.18
深蹲 42.5kg 12 12 12 11 10//左右不平衡
并脚蹲 2.5kg 12 12 12 10

2022.10.21
划船 30kg 12 12 12 11 10//还需要再体会动作 应该也是左右不平衡 恢复肌腱
下拉 25kg 12 12 12 9//再探索一下动作怎么做
划船机 22.5kg 12 12 12 12//可
//睡前要加餐 周期应该逐渐缩短 补剂每天吃 买鱼油

2022.10.24
深蹲 45kg 12 12 12 12 10 9
并脚蹲 5kg 12 11 12 12// 垫脚 收膝盖 居然没有那么想死了

2022.10.26
卧推 45kg 12 12 10 10 5
上斜 20kg 10 11 10 10//？怎么还是肩膀疼？
平板哑铃 12.5kg 12 9 10kg 10 10

2022.10.28
杠铃划船 32.5kg 12 12 12 9 8
下拉 30kg 12 12 12 10 //肩膀还是在痛
划船 18kg 10 11 11 11

2022.10.29
深蹲 47.5kg 12 12 11 10 42.5kg 10 9// 深蹲 太吃状态了，一定要休息好再开始，哪怕推迟到第二天
并脚蹲 5kg 12 12 12 10

2022.10.30
卧推 40kg 12 12 9 8//需要适应乐刻的器材 应该压到胸肌中间 这次压到是锁骨所以会肩膀痛 不对称很严重
上斜 15kg 12 12 12 9
平板哑铃 12.5kg 12 12 11 10kg 10

2022.11.1
杠铃划船 32.5kg 12 12 12 12 9//还是歪 发力感并不好
下拉 30kg 12 12 12 12
划船 18kg 12 12 12 11
杠铃弯举 12.5kg 10 10 12 12
哑铃弯举 5kg 13 13 13 12

2022.11.3
卧推 47.5kg 12 12 9 8
上斜 20kg 12 11 10 9 //也许下次应该用个重一点的
平板哑铃 12.5kg 12 12 11 9//收紧核心 发力感很好
碎裂者 10kg 12

2022.11.5
深蹲 47.5kg 12 12 12 11 8 8 //深蹲 真的不可以在乐刻做
窄蹲 7.5kg 12 12 12 12

2022.11.8
杠铃划船 35kg 12 12 12 10
下拉 31.25kg 12 12 12 11
划船 20kg 12 12 12 12
杠铃弯举 12.5kg 12 12 12 10
哑铃弯举 6kg 10 11 10 9

2022.11.10 //状态实属不行 太抑郁了
卧推 47.5kg 12 12 9 7
上斜 25kg 8 8 9 9
哑铃飞鸟 12.5kg 11 10 8
碎裂者 12.5kg 10 10

2022.11.12
深蹲 50kg 12 12 11 10 8 8
窄蹲 7.5kg 12 12 12 11

2022.11.14
杠铃划船 35kg 12 12 12 12
下拉 33.75kg 12 12 10 10
划船 22.5kg 12 12 11 11
哑铃弯举 6kg 14 13 12 11 9
杠铃弯举 12.5kg 10 10 9 8

2022.11.17//困死了 状态很差但有进步
卧推 47.5kg 12 12 12 8 9//有人来视奸，本来可以做9个，下次如果状态好可以加
上斜 25kg 12 10 11 9//要慢一点
哑铃飞鸟 12.5kg 11 10 9 8
碎裂者 12.5kg 14 12 11 10
屈伸 7.5kg 12 12 12 12

2022.11.19
深蹲 52.5kg 12 12 10 9 7//应该注意顶峰收缩，不要在膝盖伸直的时候偷懒！！！！
窄蹲 10kg 12 10 10 9

2022.11.20
杠铃划船 20kg 11 10 10 10
下拉 30kg 12 11 11 10
绳索划船 16kg 11 9 9
哑铃弯举 7.5kg 13 12 11 9 8
杠铃弯举 12.5kg 13 12 11 10

2022.11.22
卧推 50kg 12 12 10 8
上斜 25kg 10 10 9 8//核心应该收紧 还需要找感觉
哑铃飞鸟 12.5kg 12 10 9 10kg 10
碎裂者 12.5kg 15 15 15kg 12 11 9
屈伸 10kg 15 12 12 12

2022.11.26
深蹲 52.5kg 12 12 10 10 8 6//前一天登山影响状态 下次先不要加
窄蹲 10kg 12 11 9 9//注意顶峰收缩

2022.11.27
卧推 50kg 12 12 8 8 //不太舒服？
上斜 20kg 9 11 10 10 //注意看两侧小臂是否竖直 肩胛骨不要动 用固定器械会更好一点，方便固定水平位置
哑铃飞鸟 12.5kg 12 12 8 8
碎裂者 15kg 12 12 10 9
屈伸 13.6kg 11 10 10 9
哑铃弯举 7.5kg 15 14 12 10kg 6
杠铃弯举 12.5kg 12 12 10 9

2022.11.29
杠铃划船 30kg 12 11 9 8
下拉 20kg 11 10 10 10
哑铃弯举 8kg 14 12 10 10
杠铃弯举 12.5kg 12 10 10 10 //带测力计量杠铃重量

2022.11.30
卧推 50kg 12 12 7 7//没休息好🥲下次状态好可加
哑铃飞鸟 12.5kg 8
碎裂者 15kg 14 12 11 10
屈伸 12.5kg 14 12 11 11

2022.12.2
深蹲 55kg 12 12 8 7//前一天晚上休息太差了，看起来有潜力做更多

2022.12.3
杠铃划船 25kg 12 12 10 9
下拉 23kg 12 12 11 11
弯举 10kg 13 12 10 8
杠铃弯举 12.5kg 15 12 12 12
FacePull 8kg 12 12 12 12

2022.12.4
卧推 52.5kg 12 11 8 7
哑铃飞鸟 12.5kg 12 11 10 9
碎裂者 17.5kg 13 12 11 9
屈伸 13.6kg 12 11 10 9

2022.12.6
杠铃划船 27.5kg 13 12 10 10
下拉 26.25kg 12 12 11 10
哑铃弯举 10kg 15 13 10 8
杠铃弯举 15kg 11 10 9 9

2022.12.8
卧推 55kg 12 11 7 7
哑铃飞鸟 12.5kg 12 11 10 9
碎裂者 17.5kg 14 13 10 9
屈伸 15kg 12 11 10 10

2022.12.10
杠铃划船 30kg 12 12 10 9
下拉 29kg 10 10 9 9
哑铃弯举 10kg 15 12 9//状态太差 休息

2022.12.11
史密斯卧推 55kg 12 9 7 6
哑铃飞鸟 12.5kg 11 10 9 8
碎裂者 17.5kg 15 14 12 10
屈伸 16kg 12 10 9 8
哑铃弯举 10kg 15 14 11 8
杠铃弯举 15kg 12 11 10 9

2022.12.15
卧推 55kg 12 12 7 8//(退行？
哑铃飞鸟 12.5kg 11 10 8 8
碎裂者 20kg 12 10 8 8
屈伸 15kg 13 12 13 11
弯举 10kg 12 12.5kg 9 8 6

2023.1.2
杠铃划船 20kg 11 12 10 10
下拉 18kg 9 10 11 10
哑铃弯举 7.5kg 15 10kg 14 8 7.5kg 11
杠铃弯举 10kg 10
FacePull 2.5kg 12 15 13 13

2023.1.3
推举 10kg 12 12 12 11
卧推 40kg 12 12 11 9
哑铃飞鸟 8kg 10 10 10
碎裂者 12.5kg 14 12 12 11
屈伸 10kg 15 15 15 15

2023.1.5
杠铃划船 25kg 12 12 12 9//有点太快了
下拉 19kg 12 11 11 10
哑铃弯举 10kg 13 12 9 7
杠铃弯举 10kg 12 12 11 10
FacePull 5kg 13 12 12 12

2023.1.10
卧推 45kg 12 12 10 8
飞鸟 8kg 10 10 10
碎裂者 15kg 14 12 12 10
屈伸 12.5kg 13 12 13 11
推举 12.5kg 12 11 8

2023.1.12(重量有点激进
杠铃划船 30kg 12 12 9 7
下拉 21kg 11 11 11 10
哑铃弯举 12.5kg 11 8 //10kg (器械被占)
杠铃弯举 12.5kg 12 12 10
FacePull 5kg 15 7.5kg 14 13 13

2023.1.15
杠铃划船 25kg 12 10 20kg 10 10
下拉 20kg 8 10 10 9
哑铃弯举 10kg 13 12 10 8
杠铃弯举 12.5kg 12 11 10 10
FacePull 7.5kg 15 12 13 12

2023.1.16
卧推 47.5kg 12 12 9 8
飞鸟 8kg 12 11 11 11
碎裂者 15kg 15 14 12 10
屈伸 12.5kg 15 14 13 12
推举 12.5kg 11 11 9
FacePull 7.5kg 13 12

2023.1.28
卧推 30kg 12 12 11 11
飞鸟 8kg 10 10 10 9
碎裂者 10kg 15 12 11
屈伸 7.5kg 16 10kg 15 15 13
FacePull 5kg 15 14 14 14 13

2023.1.29
杠铃划船 20kg 13 12 11 10
下拉 16kg 12 12 12 12
哑铃弯举 8kg 15 15 14 12
杠铃弯举 10kg 12 12 12 12
推举 12.5kg 12 11 9

2023.2.1
卧推 35kg 12 12 12 11 //非常轻松
飞鸟 8kg 11 11 11 10
碎裂者 12.5kg 15 14 13 12
屈伸 12.5kg 15 14 13 12
FacePull 7.5kg 15 10kg 12 11 11 10 //有点重哈

2023.2.2
反手杠铃划船 22.5kg 12 12 11 10
下拉 18.75kg 12 12 12 12
哑铃弯举 10kg 14 12 9 8
杠铃弯举 12.5kg 12 11 12 10

2023.2.3
深蹲 60kg 5 5 5 5 5
侧平举 2.5kg 15 15 15 15
FacePull 10kg 15 13 12 11
推举 10kg 10 8

2023.2.6//脊柱侧弯会影响对称性 要时刻注意矫正
卧推 40kg 12 12 11 11 //状态差 有点勉强
飞鸟 8kg 10 10 10 11
碎裂者 15kg  14 13 12 9
屈伸 15kg 13 12 11 10
FacePull 10kg 15 15 14 13 //进步很快
侧平举 3kg 16 16 15 14

2023.2.7
反手杠铃划船 25kg 12 12 11 10//做太快了
下拉 21.25kg 12 12 12 12
哑铃弯举 10kg 15 14 11 8
杠铃弯举 15kg 10 11 10 9
推举 10kg 12 12 12 11
侧平举 4kg 15 15 15 14

2023.2.10
卧推 45kg 12 12 10 9
飞鸟 8kg 10 10 10 10
碎裂者 15kg 15 15 13 10
屈伸 15kg 14 13 12 11
FacePull 12.5kg 15 13 13 12
侧平举 4kg 16 16 15 14

2023.2.13
反手杠铃划船 25kg 12 12 12 12
下拉 23.75kg 12 12 12 11
哑铃弯举 10kg 15 14 10 10 //后面组歇要两分钟
杠铃弯举 15kg 12 12 11 10
推举 12.5kg 12 12 12 12
侧平举 5/3kg 15/12 13/10 11/9 9/7

2023.2.14
卧推 47.5kg 12 12 11 9
飞鸟 10kg 10 10 10 10
碎裂者 17.5kg 15 14 11 10
屈伸 15kg 15 14 12 11
FacePull 15kg 15 14 11 11

2023.2.15
深蹲 40kg 9 9 7 6
窄蹲 2.5kg 12 11 10 10

2023.2.16
反手杠铃划船 27.5kg 12 12 11 9
下拉 26.25kg 12 12 11 10
哑铃弯举 12.5kg 12 10 8 7
杠铃弯举 15kg 13 12 11 10
推举 15kg 13 12 12 10
侧平举 5/3kg 15/12 14/10 11/8 12/9
`
}


export const movementDefinitions = [
    {
        part: "Shoulder", movements: [
            "FacePull",
            "侧平举",
            "推举"
        ]
    },
    {
        part: "Chest", movements: [
            "上斜卧推",
            "上斜",
            "卧推",
            "飞鸟",
            "哑铃飞鸟",
            "平板哑铃",
            "平板飞鸟"
        ]
    },
    {
        part: "Back", movements: [
            "下拉",
            "划船",
            "反手杠铃划船",
            "杠铃划船",
            "绳索划船"
        ]
    },
    {
        part: "Bicep", movements: [
            "哑铃弯举",
            "杠铃弯举",
            "弯举"
        ]
    },
    {
        part: "Tricep", movements: [
            "屈伸",
            "碎裂者"
        ]
    },
    {
        part: "Legs", movements: [
            "并脚蹲",
            "深蹲",
            "窄蹲",
            "硬拉"
        ]
    }
]


export const movementToPart = new Map<string, string>();

movementDefinitions.map((definition) => {
    return definition.movements.map((movement) => [movement, definition.part])
}).reduce((a, b) => a.concat(b), []).forEach((pair) => {
    movementToPart.set(pair[0], pair[1]);
});